read_verilog -I rtl rtl/common_defs.vh
read_verilog -I rtl rtl/gray_counter_ce.v

hierarchy -check -top gray_counter_ce

proc
opt
fsm
opt
memory
opt
write_verilog -noattr synth/reports/gray_counter_ce_formal_netlist.v
techmap
opt

abc
clean

tee -o synth/reports/gray_counter_ce_stat.txt stat
write_json synth/reports/gray_counter_ce.json
write_verilog -noattr synth/reports/gray_counter_ce_netlist.v
