read_verilog -I rtl rtl/common_defs.vh
read_verilog rtl/gray_counter.v
prep -top gray_counter
async2sync
clk2fflogic
design -stash gold

design -reset
read_verilog synth/reports/gray_counter_formal_netlist.v
prep -top gray_counter
async2sync
clk2fflogic
design -stash gate

design -copy-from gold -as gold gray_counter
design -copy-from gate -as gate gray_counter

equiv_make gold gate equiv
prep -top equiv
equiv_simple
equiv_status -assert
